README.md

# Table of Contents

1.  [Setting up the project](#orgf965f69)


<a id="orgf965f69"></a>

# Setting up the project

1.  Install [nix](https://nixos.org/download.html)
2.  [Install](https://direnv.net/docs/installation.html) and [configure](https://direnv.net/docs/hook.html) direnv
    On mac, if you run into issues, do this:
    
        eval "$(direnv hook $SHELL)"
3.  [Enable flakes](https://nixos.wiki/wiki/Flakes#Permanent)
    Add the following to the file `/etc/nix/nix.conf`:
    
        experimental-features = nix-command flakes
4.  Run `direnv allow` in the project root
    Now, whenever you enter the project root or its subfolders within a shell, all of the packages defined in [flake.nix](flake.nix) should be available to you.

